**`teams/nomis/windows_server_2022_jumpserver`** terraform plan on `push` event [#445](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_component.this["../components/windows_server_2022_jumpserver/jumpserver.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.8/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: Jumpserver
            description: Jumpserver provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 1.0.8
          +       default: 1.0.9
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: ConfigureJava
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $S3_BUCKET = "ec2-image-builder-nomis20220314103938567000000001"
            
                          # Download/Install Java
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/jre-6u33-windows-i586.exe -File C:\jumpserver-software\jre-6u33-windows-i586.exe
                          Start-Process -Wait -FilePath "C:\jumpserver-software\jre-6u33-windows-i586.exe" -ArgumentList "/qn", "/s", "/v" -PassThru -RedirectStandardOutput "C:\jumpserver-software\jre-install.log"
            
                          # Copy deployment config files
                          $deployment_folder = "C:\Windows\Sun\Java\Deployment"
                          New-Item -Path $deployment_folder -ItemType Directory -Force
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.config -File $deployment_folder\deployment.config
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.properties -File $deployment_folder\deployment.properties
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/trusted.certs -File $deployment_folder\trusted.certs
            
                          # Prevent Java update check
                          Remove-ItemProperty -Path "HKLM:\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Run" -Name SunJavaUpdateSched -Force -ErrorAction SilentlyContinue
                  - name: ConfigureTrustedSites
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Add Nomis sites to trusted sites
                          $sites = @(
                              "*.nomis.hmpps-test.modernisation-platform.internal"
                              "*.nomis.hmpps-test.modernisation-platform.justice.gov.uk"
                              "*.nomis.hmpps-production.modernisation-platform.internal"
                              "*.nomis.hmpps-production.modernisation-platform.justice.gov.uk"
                              "*.modernisation-platform.nomis.az.justice.gov.uk"
                          )
            
                          $paths = @(
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains"
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\EscDomains"
                          )
            
                          foreach($path in $paths){
                            $sites | ForEach-Object {
                                New-Item -Path $path\$_ -Force
                                New-ItemProperty -Path $path\$_ -Name http -Value 2 -PropertyType DWORD -Force
                                New-ItemProperty -Path $path\$_ -Name https -Value 2 -PropertyType DWORD -Force
                            }
                          }
            
                          # Use Local Machine settings for Internet Security Settings
                          $reg_path = "HKLM:\Software\Policies\Microsoft\Windows\CurrentVersion\Internet Settings"
                          New-Item -Path $reg_path -Force
                          New-ItemProperty -Path $reg_path -Name Security_HKLM_only -Value 1 -PropertyType DWORD -Force
        EOT
      ~ date_created          = "2022-09-14T10:28:50.121Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.8/1" -> (known after apply)
        name                  = "Jumpserver"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.0.8" -> "1.0.9" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_component.this["../components/windows_server_2022_jumpserver/prometheus_windows_exporter.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.6/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: PrometheusWindowsExporter
            description: Component to install prometheus windows exporter.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 1.0.6
          +       default: 1.0.7
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - WindowsExporterVersion:
                  type: string
                  default: 0.19.0
                  description: Version of the prometheus-windows-exporter
            phases:
              - name: build
                steps:
                  - name: InstallWMIExporter
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - choco install -y prometheus-windows-exporter.install --version '{{ WindowsExporterVersion }}' --params '"/ListenPort:9100"'
        EOT
      ~ date_created          = "2022-09-14T10:28:50.199Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.6/1" -> (known after apply)
        name                  = "PrometheusWindowsExporter"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.0.6" -> "1.0.7" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2022-jumpserver"
        name         = "nomis_windows_server_2022_jumpserver"
      ~ tags         = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ date_created                     = "2022-09-14T10:59:54.049Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-14T11:00:48.769Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-14T10:59:54.049Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.1" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-0-1" -> (known after apply)
        name                             = "nomis_windows_server_2022_jumpserver"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)


      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.1" -> (known after apply)
      ~ date_created     = "2022-09-14T10:59:52.327Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.1" -> (known after apply)
        name             = "nomis_windows_server_2022_jumpserver"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.1" -> "0.0.2" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.8/1" -> (known after apply) # forces replacement
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.6/1" -> (known after apply) # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-0-1" -> (known after apply)
      ~ date_created                  = "2022-09-14T10:28:50.097Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-0-1" -> (known after apply)
      ~ name                          = "nomis_windows_server_2022_jumpserver_0_0_1" -> "nomis_windows_server_2022_jumpserver_0_0_2" # forces replacement
      ~ resource_tags                 = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "Jumpserver-version"                      = "1.0.8" -> "1.0.9"
          ~ "PrometheusWindowsExporter-version"       = "1.0.6" -> "1.0.7"
          ~ "branch"                                  = "nomis/DSOS-1478/refactor-jumpserver-ami" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.1" -> "nomis_windows_server_2022_jumpserver/0.0.2"
          ~ "is-production"                           = "false" -> "true"
            # (10 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```